org-init/god-init.org
#+SETUPFILE: ~/.emacs.d/org-init/level-0.orgsetup
* Emacs God Mode

** Usage
   From: github.com/chrisdone/god-mode/blob/master/README.md
   #+BEGIN_SRC markdown
     ## Mapping

     This library defines the following mapping:

     ,* All commands are assumed to be `C-<something>` unless otherwise
        indicated. Examples:

        ,* `a`    -> `C-a`
        ,* `s`    -> `C-s`
        ,* `akny` -> `C-a C-k C-n C-y`
        ,* `xs`   -> `C-x C-s`
        ,* `x s`  -> `C-x s`

        Note the use of space to produce `C-x s`.

     ,* `g` is a special key to indicate `M-<something>`. This means that
        there is no way to write `C-g` in this mode, you must therefore
        type `C-g` directly. Examples:

        ,* `gf` -> `M-f`
        ,* `gx` -> `M-x`

     ,* `G` is a special key to indicate `C-M-<something>`. Example:

        ,* `Gx` -> `C-M-x`

     ,* Digit arguments:

       ,* `12f` -> `M-12 C-f`

     ,* Repetition (with `.` keybinding):

       ,* `gf..` -> `M-f M-f M-f`

     ,* Universal boolean argument:

       ,* `uco` -> `C-u C-c C-o`
   #+END_SRC

** Custom Bindings

   #+BEGIN_SRC emacs-lisp
     (defun my-update-cursor ()
       (setq cursor-type (if (or god-local-mode buffer-read-only) 'bar 'box)))

     (eval-after-load 'god-mode
       '(progn
          (global-unset-key [escape])
          (global-unset-key (kbd "C--"))

          (global-set-key (kbd "<escape>") 'god-local-mode)
          ;; (global-set-key (kbd "<escape>") 'god-mode-all)

          (global-set-key (kbd "C-x C-1") 'delete-other-windows)
          (global-set-key (kbd "C-x C-2") 'split-window-below)
          (global-set-key (kbd "C-x C-3") 'split-window-right)
          (global-set-key (kbd "C-x C-0") 'delete-window)
          (global-set-key (kbd "C-x C-o") 'other-window)

          (define-key god-local-mode-map (kbd "C-<return>") 'god-local-mode)
          (define-key god-local-mode-map (kbd ".") 'repeat)

          (define-key god-local-mode-map  (kbd "C--") 'negative-argument)

          (add-hook 'god-mode-enabled-hook  'my-update-cursor)
          (add-hook 'god-mode-disabled-hook 'my-update-cursor)

          (defun god-toggle-on-overwrite ()
            "Toggle god-mode on overwrite-mode."
            (if (bound-and-true-p overwrite-mode)
                (god-local-mode-pause)
              (god-local-mode-resume)))

          (add-hook 'overwrite-mode-hook 'god-toggle-on-overwrite)

          (add-to-list 'god-exempt-major-modes 'cider-test-report-mode)
          (add-to-list 'god-exempt-major-modes 'cider-stacktrace-mode)
          (add-to-list 'god-exempt-major-modes 'ag-mode)

          (defun c/god-mode-update-cursor ()
            (let ((limited-colors-p (> 257 (length (defined-colors)))))
              (cond (god-local-mode
                     (progn
                       (set-face-background 'mode-line (if limited-colors-p "white" "#e9e2cb"))
                       (set-face-background 'mode-line-inactive (if limited-colors-p "white" "#e9e2cb"))))
                    (t (progn
                         (set-face-background 'mode-line (if limited-colors-p "black" "#0a2832"))
                         (set-face-background 'mode-line-inactive (if limited-colors-p "black" "#0a2832")))))))

          (require 'god-mode-isearch)
          (define-key isearch-mode-map (kbd "<escape>") 'god-mode-isearch-activate)
          (define-key god-mode-isearch-map (kbd "<escape>") 'god-mode-isearch-disable)))
   #+END_SRC

#+BEGIN_SRC emacs-lisp
(provide 'god-init)
#+END_SRC

